*** src/cascade/engine.rs:119:66: replace / with % in compute_cascade

*** mutation diff:
--- src/cascade/engine.rs
+++ replace / with % in compute_cascade
@@ -111,17 +111,17 @@
 
             // NEW-BUG-1 FIX: child absorbs interval duration (prop_down + self_blame)
             let child_subtree_absorbed = interval.window.duration();
 
             let external_waiters = count_concurrent_waiters(graph, next_node, &interval.window);
             let scale_target = target_count.max(1);
             let scale_external = external_waiters.max(1);
 
-            let transfer = child_subtree_absorbed / scale_target / scale_external;
+            let transfer = child_subtree_absorbed / scale_target % /* ~ changed by cargo-mutants ~ */ scale_external;
             total_propagated += transfer;
         }
     }
 
     path.remove(&current);
     total_propagated
 }

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (312372) panicked at src/cascade/engine.rs:186:9:
assertion `left == right` failed: User→Parser
  left: 100
 right: 20

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (312371) panicked at src/cascade/engine.rs:210:9:
assertion `left == right` failed
  left: 100
 right: 20

---- scc::heuristic::tests::heuristic_on_figure4 stdout ----

thread 'scc::heuristic::tests::heuristic_on_figure4' (312430) panicked at src/scc/heuristic.rs:139:9:
assertion `left == right` failed
  left: 100
 right: 80

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    scc::heuristic::tests::heuristic_on_figure4

test result: FAILED. 55 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
