*** src/cascade/engine.rs:92:14: replace >= with < in compute_cascade

*** mutation diff:
--- src/cascade/engine.rs
+++ replace >= with < in compute_cascade
@@ -84,17 +84,17 @@
 fn compute_cascade(
     graph: &WaitForGraph,
     current: ThreadId,
     window: &TimeWindow,
     depth: u32,
     max_depth: u32,
     path: &mut BTreeSet<ThreadId>,
 ) -> u64 {
-    if depth >= max_depth || path.contains(&current) {
+    if depth < /* ~ changed by cargo-mutants ~ */ max_depth || path.contains(&current) {
         return 0;
     }
 
     let intervals = sweep_line_partition(graph, current, window);
     if intervals.is_empty() {
         return 0;
     }

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (310666) panicked at src/cascade/engine.rs:210:9:
assertion `left == right` failed
  left: 100
 right: 20

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (310667) panicked at src/cascade/engine.rs:186:9:
assertion `left == right` failed: User→Parser
  left: 100
 right: 20

---- scc::heuristic::tests::heuristic_on_figure4 stdout ----

thread 'scc::heuristic::tests::heuristic_on_figure4' (310707) panicked at src/scc/heuristic.rs:139:9:
assertion `left == right` failed
  left: 100
 right: 80

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    scc::heuristic::tests::heuristic_on_figure4

test result: FAILED. 55 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
