*** src/cascade/engine.rs:92:5: replace compute_cascade -> u64 with 1

*** mutation diff:
--- src/cascade/engine.rs
+++ replace compute_cascade -> u64 with 1
@@ -84,50 +84,17 @@
 fn compute_cascade(
     graph: &WaitForGraph,
     current: ThreadId,
     window: &TimeWindow,
     depth: u32,
     max_depth: u32,
     path: &mut BTreeSet<ThreadId>,
 ) -> u64 {
-    if depth >= max_depth || path.contains(&current) {
-        return 0;
-    }
-
-    let intervals = sweep_line_partition(graph, current, window);
-    if intervals.is_empty() {
-        return 0;
-    }
-
-    path.insert(current);
-    let mut total_propagated: u64 = 0;
-
-    for interval in &intervals {
-        let target_count = interval.targets.len() as u64;
-
-        for &next_node in &interval.targets {
-            let _prop_down = compute_cascade(
-                graph, next_node, &interval.window, depth + 1, max_depth, path,
-            );
-
-            // NEW-BUG-1 FIX: child absorbs interval duration (prop_down + self_blame)
-            let child_subtree_absorbed = interval.window.duration();
-
-            let external_waiters = count_concurrent_waiters(graph, next_node, &interval.window);
-            let scale_target = target_count.max(1);
-            let scale_external = external_waiters.max(1);
-
-            let transfer = child_subtree_absorbed / scale_target / scale_external;
-            total_propagated += transfer;
-        }
-    }
-
-    path.remove(&current);
-    total_propagated
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn count_concurrent_waiters(
     graph: &WaitForGraph,
     target: ThreadId,
     window: &TimeWindow,
 ) -> u64 {
     let node_idx = match graph.node_index(&target) {

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (308742) panicked at src/cascade/engine.rs:153:9:
assertion `left == right` failed: User→Parser
  left: 99
 right: 20

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (308741) panicked at src/cascade/engine.rs:177:9:
assertion `left == right` failed
  left: 99
 right: 20

---- cascade::engine::tests::cascade_single_edge stdout ----

thread 'cascade::engine::tests::cascade_single_edge' (308745) panicked at src/cascade/engine.rs:140:9:
assertion `left == right` failed
  left: 49
 right: 50

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_single_edge
    scc::heuristic::tests::heuristic_on_figure4
    scc::heuristic::tests::singleton_weight_from_incident_edges

test result: FAILED. 53 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
