*** src/cascade/invariants.rs:117:47: replace == with != in check_idempotency

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace == with != in check_idempotency
@@ -109,17 +109,17 @@
     let e2 = second.all_edges();
 
     if e1.len() != e2.len() {
         return false;
     }
 
     e1.iter()
         .zip(e2.iter())
-        .all(|(a, b)| a.3.attributed_delay_ms == b.3.attributed_delay_ms)
+        .all(|(a, b)| a.3.attributed_delay_ms != /* ~ changed by cargo-mutants ~ */ b.3.attributed_delay_ms)
 }
 
 /// I-6: Depth monotonicity.
 /// Increasing max_depth propagates more weight downstream, so
 /// total_attributed(deep) ≤ total_attributed(shallow).
 /// Test-only — runs cascade at two depths.
 pub fn check_depth_monotonicity(graph: &WaitForGraph) -> bool {
     use super::engine::cascade_engine;

---- cascade::invariants::tests::idempotency_passes_on_figure4 stdout ----

thread 'cascade::invariants::tests::idempotency_passes_on_figure4' (342039) panicked at src/cascade/invariants.rs:257:9:
assertion failed: check_idempotency(&g, 10)

failures:
    cascade::invariants::tests::idempotency_passes_on_figure4

test result: FAILED. 57 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
