*** src/cascade/invariants.rs:18:5: replace is_conserved -> bool with true

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace is_conserved -> bool with true
@@ -10,17 +10,17 @@
 /// Checks I-2 (non-amplification) + I-7 (locality). This runs in ALL
 /// builds — it is the first line of defense against algorithm bugs.
 ///
 /// Note: global sum equality (`Σ attributed == Σ raw`) does NOT hold
 /// after cascade redistribution. The cascade absorbs weight at
 /// intermediate nodes, so `total_attributed ≤ total_raw`. Per-edge
 /// non-amplification (I-2) is the correct conservation check.
 pub fn is_conserved(original: &WaitForGraph, result: &WaitForGraph) -> bool {
-    check_non_amplification(result) && check_locality(original, result)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// I-1 enforcement: call after every cascade run.
 /// Panics in debug builds, logs warning in release builds.
 /// Returns the conservation status.
 pub fn assert_weight_conserved(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     let i2 = check_non_amplification(result);
     let i7 = check_locality(original, result);

---- cascade::invariants::tests::conservation_detects_amplification stdout ----

thread 'cascade::invariants::tests::conservation_detects_amplification' (319463) panicked at src/cascade/invariants.rs:175:9:
assertion failed: !is_conserved(&g, &bad)

---- cascade::invariants::tests::conservation_detects_locality_violation stdout ----

thread 'cascade::invariants::tests::conservation_detects_locality_violation' (319464) panicked at src/cascade/invariants.rs:189:9:
assertion failed: !is_conserved(&g, &bad)

failures:
    cascade::invariants::tests::conservation_detects_amplification
    cascade::invariants::tests::conservation_detects_locality_violation

test result: FAILED. 56 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
