*** src/cascade/invariants.rs:18:5: replace is_conserved -> bool with false

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace is_conserved -> bool with false
@@ -10,17 +10,17 @@
 /// Checks I-2 (non-amplification) + I-7 (locality). This runs in ALL
 /// builds — it is the first line of defense against algorithm bugs.
 ///
 /// Note: global sum equality (`Σ attributed == Σ raw`) does NOT hold
 /// after cascade redistribution. The cascade absorbs weight at
 /// intermediate nodes, so `total_attributed ≤ total_raw`. Per-edge
 /// non-amplification (I-2) is the correct conservation check.
 pub fn is_conserved(original: &WaitForGraph, result: &WaitForGraph) -> bool {
-    check_non_amplification(result) && check_locality(original, result)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// I-1 enforcement: call after every cascade run.
 /// Panics in debug builds, logs warning in release builds.
 /// Returns the conservation status.
 pub fn assert_weight_conserved(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     let i2 = check_non_amplification(result);
     let i7 = check_locality(original, result);

---- cascade::engine::tests::cascade_no_amplification stdout ----

thread 'cascade::engine::tests::cascade_no_amplification' (320264) panicked at src/cascade/engine.rs:230:9:
assertion failed: is_conserved(&g, &result)

---- cascade::invariants::tests::conservation_passes_on_cascade_result stdout ----

thread 'cascade::invariants::tests::conservation_passes_on_cascade_result' (320268) panicked at src/cascade/invariants.rs:160:9:
assertion failed: is_conserved(&g, &result)

---- cascade::invariants::tests::conservation_passes_on_identity stdout ----

thread 'cascade::invariants::tests::conservation_passes_on_identity' (320269) panicked at src/cascade/invariants.rs:146:9:
assertion failed: is_conserved(&g, &result)

failures:
    cascade::engine::tests::cascade_no_amplification
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::conservation_passes_on_identity

test result: FAILED. 55 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
