*** src/cascade/invariants.rs:49:5: replace check_non_amplification -> bool with true

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace check_non_amplification -> bool with true
@@ -41,20 +41,17 @@
     }
 
     conserved
 }
 
 /// I-2: Non-amplification.
 /// No edge's attributed_delay_ms may exceed its raw_wait_ms.
 pub fn check_non_amplification(result: &WaitForGraph) -> bool {
-    result
-        .all_edges()
-        .iter()
-        .all(|(_, _, _, ew)| ew.attributed_delay_ms <= ew.raw_wait_ms)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// I-3: Non-negativity.
 /// All attributed_delay_ms >= 0. Trivially true for u64, but documents intent.
 pub fn check_non_negativity(_result: &WaitForGraph) -> bool {
     true // u64 is always >= 0
 }

---- cascade::invariants::tests::conservation_detects_amplification stdout ----

thread 'cascade::invariants::tests::conservation_detects_amplification' (325194) panicked at src/cascade/invariants.rs:172:9:
assertion failed: !is_conserved(&g, &bad)

---- cascade::invariants::tests::non_amplification_detects_violation stdout ----

thread 'cascade::invariants::tests::non_amplification_detects_violation' (325203) panicked at src/cascade/invariants.rs:208:9:
assertion failed: !check_non_amplification(&g)

failures:
    cascade::invariants::tests::conservation_detects_amplification
    cascade::invariants::tests::non_amplification_detects_violation

test result: FAILED. 56 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
