*** src/cascade/invariants.rs:49:5: replace check_non_amplification -> bool with false

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace check_non_amplification -> bool with false
@@ -41,20 +41,17 @@
     }
 
     conserved
 }
 
 /// I-2: Non-amplification.
 /// No edge's attributed_delay_ms may exceed its raw_wait_ms.
 pub fn check_non_amplification(result: &WaitForGraph) -> bool {
-    result
-        .all_edges()
-        .iter()
-        .all(|(_, _, _, ew)| ew.attributed_delay_ms <= ew.raw_wait_ms)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// I-3: Non-negativity.
 /// All attributed_delay_ms >= 0. Trivially true for u64, but documents intent.
 pub fn check_non_negativity(_result: &WaitForGraph) -> bool {
     true // u64 is always >= 0
 }

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (327211) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=false, I-7=true)

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (327206) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=false, I-7=true)

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (327209) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=false, I-7=true)

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::conservation_passes_on_identity
    cascade::invariants::tests::depth_monotonicity_passes_on_chain
    cascade::invariants::tests::idempotency_passes_on_figure4
    cascade::invariants::tests::non_amplification_passes
    critical_path::tests::branching_picks_heavier_path
    critical_path::tests::figure4_critical_path

test result: FAILED. 41 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
