*** src/cascade/invariants.rs:58:5: replace check_non_negativity -> bool with false

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace check_non_negativity -> bool with false
@@ -50,17 +50,17 @@
         .all_edges()
         .iter()
         .all(|(_, _, _, ew)| ew.attributed_delay_ms <= ew.raw_wait_ms)
 }
 
 /// I-3: Non-negativity.
 /// All attributed_delay_ms >= 0. Trivially true for u64, but documents intent.
 pub fn check_non_negativity(_result: &WaitForGraph) -> bool {
-    true // u64 is always >= 0
+    false /* ~ changed by cargo-mutants ~ */ // u64 is always >= 0
 }
 
 /// I-4: Termination.
 /// Cascade must not create or remove nodes/edges.
 /// The topology of the result must match the original.
 pub fn check_termination(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     original.node_count() == result.node_count()
         && original.edge_count() == result.edge_count()

---- cascade::engine::tests::cascade_no_amplification stdout ----

thread 'cascade::engine::tests::cascade_no_amplification' (327910) panicked at src/cascade/engine.rs:62:5:
I-3 VIOLATION: negative attributed delay

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (327907) panicked at src/cascade/engine.rs:62:5:
I-3 VIOLATION: negative attributed delay

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (327909) panicked at src/cascade/engine.rs:62:5:
I-3 VIOLATION: negative attributed delay

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::depth_monotonicity_passes_on_chain
    cascade::invariants::tests::idempotency_passes_on_figure4
    cascade::invariants::tests::non_negativity_trivially_true
    critical_path::tests::branching_picks_heavier_path
    critical_path::tests::figure4_critical_path
    critical_path::tests::long_chain_linear_complexity

test result: FAILED. 42 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
