*** src/cascade/invariants.rs:65:5: replace check_termination -> bool with true

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace check_termination -> bool with true
@@ -57,18 +57,17 @@
 pub fn check_non_negativity(_result: &WaitForGraph) -> bool {
     true // u64 is always >= 0
 }
 
 /// I-4: Termination.
 /// Cascade must not create or remove nodes/edges.
 /// The topology of the result must match the original.
 pub fn check_termination(original: &WaitForGraph, result: &WaitForGraph) -> bool {
-    original.node_count() == result.node_count()
-        && original.edge_count() == result.edge_count()
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// I-7: Locality.
 /// Every edge in result must correspond to an edge in original with
 /// the same (src, dst) and time_window.
 pub fn check_locality(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     let orig_edges = original.all_edges();
     let res_edges = result.all_edges();

---- cascade::invariants::tests::termination_detects_topology_change stdout ----

thread 'cascade::invariants::tests::termination_detects_topology_change' (329800) panicked at src/cascade/invariants.rs:244:9:
assertion failed: !check_termination(&g, &bad)

failures:
    cascade::invariants::tests::termination_detects_topology_change

test result: FAILED. 57 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
