*** src/cascade/invariants.rs:66:34: replace == with != in check_termination

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace == with != in check_termination
@@ -58,17 +58,17 @@
     true // u64 is always >= 0
 }
 
 /// I-4: Termination.
 /// Cascade must not create or remove nodes/edges.
 /// The topology of the result must match the original.
 pub fn check_termination(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     original.node_count() == result.node_count()
-        && original.edge_count() == result.edge_count()
+        && original.edge_count() != /* ~ changed by cargo-mutants ~ */ result.edge_count()
 }
 
 /// I-7: Locality.
 /// Every edge in result must correspond to an edge in original with
 /// the same (src, dst) and time_window.
 pub fn check_locality(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     let orig_edges = original.all_edges();
     let res_edges = result.all_edges();

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (332289) panicked at src/cascade/engine.rs:68:5:
I-4 VIOLATION: cascade changed graph topology

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (332291) panicked at src/cascade/engine.rs:68:5:
I-4 VIOLATION: cascade changed graph topology

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (332293) panicked at src/cascade/engine.rs:68:5:
I-4 VIOLATION: cascade changed graph topology

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::depth_monotonicity_passes_on_chain
    cascade::invariants::tests::idempotency_passes_on_figure4
    cascade::invariants::tests::termination_passes_on_clone
    critical_path::tests::branching_picks_heavier_path
    critical_path::tests::figure4_critical_path
    critical_path::tests::long_chain_linear_complexity

test result: FAILED. 42 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
