*** src/cascade/invariants.rs:73:5: replace check_locality -> bool with true

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace check_locality -> bool with true
@@ -65,39 +65,17 @@
     original.node_count() == result.node_count()
         && original.edge_count() == result.edge_count()
 }
 
 /// I-7: Locality.
 /// Every edge in result must correspond to an edge in original with
 /// the same (src, dst) and time_window.
 pub fn check_locality(original: &WaitForGraph, result: &WaitForGraph) -> bool {
-    let orig_edges = original.all_edges();
-    let res_edges = result.all_edges();
-
-    if orig_edges.len() != res_edges.len() {
-        return false;
-    }
-
-    for (orig, res) in orig_edges.iter().zip(res_edges.iter()) {
-        // Same endpoints
-        if orig.1 != res.1 || orig.2 != res.2 {
-            return false;
-        }
-        // Same time window
-        if orig.3.time_window != res.3.time_window {
-            return false;
-        }
-        // Same raw_wait
-        if orig.3.raw_wait_ms != res.3.raw_wait_ms {
-            return false;
-        }
-    }
-
-    true
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// I-5: Idempotency.
 /// cascade(cascade(G)) == cascade(G).
 /// Test-only — running cascade twice is expensive.
 pub fn check_idempotency(graph: &WaitForGraph, max_depth: u32) -> bool {
     use super::engine::cascade_engine;

---- cascade::invariants::tests::conservation_detects_locality_violation stdout ----

thread 'cascade::invariants::tests::conservation_detects_locality_violation' (333935) panicked at src/cascade/invariants.rs:167:9:
assertion failed: !is_conserved(&g, &bad)

---- cascade::invariants::tests::locality_detects_extra_edge stdout ----

thread 'cascade::invariants::tests::locality_detects_extra_edge' (333940) panicked at src/cascade/invariants.rs:273:9:
assertion failed: !check_locality(&g, &bad)

---- cascade::invariants::tests::locality_detects_window_change stdout ----

thread 'cascade::invariants::tests::locality_detects_window_change' (333941) panicked at src/cascade/invariants.rs:288:9:
assertion failed: !check_locality(&g, &bad)

failures:
    cascade::invariants::tests::conservation_detects_locality_violation
    cascade::invariants::tests::locality_detects_extra_edge
    cascade::invariants::tests::locality_detects_window_change

test result: FAILED. 55 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
