*** src/cascade/invariants.rs:76:25: replace != with == in check_locality

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace != with == in check_locality
@@ -68,17 +68,17 @@
 
 /// I-7: Locality.
 /// Every edge in result must correspond to an edge in original with
 /// the same (src, dst) and time_window.
 pub fn check_locality(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     let orig_edges = original.all_edges();
     let res_edges = result.all_edges();
 
-    if orig_edges.len() != res_edges.len() {
+    if orig_edges.len() == /* ~ changed by cargo-mutants ~ */ res_edges.len() {
         return false;
     }
 
     for (orig, res) in orig_edges.iter().zip(res_edges.iter()) {
         // Same endpoints
         if orig.1 != res.1 || orig.2 != res.2 {
             return false;
         }

---- cascade::engine::tests::cascade_no_amplification stdout ----

thread 'cascade::engine::tests::cascade_no_amplification' (334283) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (334259) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (334262) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::invariants::tests::conservation_detects_locality_violation
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::conservation_passes_on_identity
    cascade::invariants::tests::depth_monotonicity_passes_on_chain
    cascade::invariants::tests::idempotency_passes_on_figure4
    cascade::invariants::tests::locality_detects_extra_edge
    cascade::invariants::tests::locality_passes_on_clone

test result: FAILED. 39 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
