*** src/cascade/invariants.rs:82:19: replace != with == in check_locality

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace != with == in check_locality
@@ -74,17 +74,17 @@
     let res_edges = result.all_edges();
 
     if orig_edges.len() != res_edges.len() {
         return false;
     }
 
     for (orig, res) in orig_edges.iter().zip(res_edges.iter()) {
         // Same endpoints
-        if orig.1 != res.1 || orig.2 != res.2 {
+        if orig.1 == /* ~ changed by cargo-mutants ~ */ res.1 || orig.2 != res.2 {
             return false;
         }
         // Same time window
         if orig.3.time_window != res.3.time_window {
             return false;
         }
         // Same raw_wait
         if orig.3.raw_wait_ms != res.3.raw_wait_ms {

---- cascade::engine::tests::cascade_single_edge stdout ----

thread 'cascade::engine::tests::cascade_single_edge' (336435) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

---- cascade::engine::tests::cascade_no_amplification stdout ----

thread 'cascade::engine::tests::cascade_no_amplification' (336434) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (336431) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::conservation_passes_on_identity
    cascade::invariants::tests::depth_monotonicity_passes_on_chain
    cascade::invariants::tests::idempotency_passes_on_figure4
    cascade::invariants::tests::locality_passes_on_clone
    critical_path::tests::branching_picks_heavier_path
    critical_path::tests::figure4_critical_path

test result: FAILED. 41 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
