*** src/cascade/invariants.rs:82:28: replace || with && in check_locality

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace || with && in check_locality
@@ -74,17 +74,17 @@
     let res_edges = result.all_edges();
 
     if orig_edges.len() != res_edges.len() {
         return false;
     }
 
     for (orig, res) in orig_edges.iter().zip(res_edges.iter()) {
         // Same endpoints
-        if orig.1 != res.1 || orig.2 != res.2 {
+        if orig.1 != res.1 && /* ~ changed by cargo-mutants ~ */ orig.2 != res.2 {
             return false;
         }
         // Same time window
         if orig.3.time_window != res.3.time_window {
             return false;
         }
         // Same raw_wait
         if orig.3.raw_wait_ms != res.3.raw_wait_ms {

*** result: Success
