*** src/graph/sweep.rs:61:14: replace >= with < in sweep_line_partition

*** mutation diff:
--- src/graph/sweep.rs
+++ replace >= with < in sweep_line_partition
@@ -53,17 +53,17 @@
         points.insert(w.end_ms);
     }
     let points: Vec<u64> = points.into_iter().collect(); // already sorted (BTreeSet)
 
     // Sweep: for each consecutive pair, find active targets
     let mut result = Vec::new();
     for pair in points.windows(2) {
         let (s, e) = (pair[0], pair[1]);
-        if s >= e {
+        if s < /* ~ changed by cargo-mutants ~ */ e {
             continue;
         }
         let sub = TimeWindow::new(s, e);
 
         // Targets active during this sub-interval
         let mut targets: Vec<ThreadId> = clipped
             .iter()
             .filter(|(w, _)| w.start_ms <= s && w.end_ms >= e)

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (302439) panicked at src/cascade/engine.rs:186:9:
assertion `left == right` failed: User→Parser
  left: 100
 right: 20

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (302438) panicked at src/cascade/engine.rs:210:9:
assertion `left == right` failed
  left: 100
 right: 20

---- graph::sweep::tests::non_overlapping_edges stdout ----

thread 'graph::sweep::tests::non_overlapping_edges' (302464) panicked at src/graph/sweep.rs:164:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    graph::sweep::tests::non_overlapping_edges
    graph::sweep::tests::single_edge_full_overlap
    graph::sweep::tests::single_edge_partial_overlap
    graph::sweep::tests::total_coverage_equals_sum_of_intervals
    graph::sweep::tests::two_overlapping_edges
    scc::heuristic::tests::heuristic_on_figure4

test result: FAILED. 50 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
