*** src/graph/wfg.rs:146:9: replace WaitForGraph::total_attributed -> u64 with 1

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::total_attributed -> u64 with 1
@@ -138,17 +138,17 @@
 
     /// Sum of all raw_wait_ms across all edges.
     pub fn total_raw_wait(&self) -> u64 {
         self.graph.edge_indices().map(|e| self.graph[e].raw_wait_ms).sum()
     }
 
     /// Sum of all attributed_delay_ms across all edges.
     pub fn total_attributed(&self) -> u64 {
-        self.graph.edge_indices().map(|e| self.graph[e].attributed_delay_ms).sum()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for WaitForGraph {
     fn default() -> Self {
         Self::new()
     }
 }

*** result: Success
