*** src/graph/wfg.rs:55:9: replace WaitForGraph::node_index -> Option<NodeIndex> with Some(Default::default())

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::node_index -> Option<NodeIndex> with Some(Default::default())
@@ -47,17 +47,17 @@
 
     /// Get the ThreadId for a NodeIndex.
     pub fn thread_id(&self, idx: NodeIndex) -> ThreadId {
         self.graph[idx].tid
     }
 
     /// Get NodeIndex for a ThreadId.
     pub fn node_index(&self, tid: &ThreadId) -> Option<NodeIndex> {
-        self.node_map.get(tid).copied()
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get all outgoing edges from `node` as (EdgeIndex, dst_ThreadId, &EdgeWeight).
     pub fn outgoing_edges(&self, node: NodeIndex) -> Vec<(EdgeIndex, ThreadId, &EdgeWeight)> {
         self.graph
             .edges_directed(node, Direction::Outgoing)
             .map(|e| (e.id(), self.graph[e.target()].tid, e.weight()))
             .collect()

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (286314) panicked at src/cascade/engine.rs:186:9:
assertion `left == right` failed: User→Parser
  left: 0
 right: 20

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (286315) panicked at src/cascade/engine.rs:223:9:
assertion failed: parser_network.3.attributed_delay_ms > 0

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (286313) panicked at src/cascade/engine.rs:210:9:
assertion `left == right` failed
  left: 0
 right: 20

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_single_edge
    critical_path::tests::branching_picks_heavier_path
    critical_path::tests::figure4_critical_path
    critical_path::tests::single_edge_critical_path
    scc::heuristic::tests::apply_heuristic_sets_weights
    scc::heuristic::tests::heuristic_on_figure4
    scc::heuristic::tests::singleton_weight_from_incident_edges
    scc::knot::tests::pure_kernel_scc_excluded

test result: FAILED. 47 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
