*** src/graph/wfg.rs:68:9: replace WaitForGraph::incoming_edges -> Vec<(EdgeIndex, ThreadId, &EdgeWeight)> with vec![]

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::incoming_edges -> Vec<(EdgeIndex, ThreadId, &EdgeWeight)> with vec![]
@@ -60,20 +60,17 @@
         self.graph
             .edges_directed(node, Direction::Outgoing)
             .map(|e| (e.id(), self.graph[e.target()].tid, e.weight()))
             .collect()
     }
 
     /// Get all incoming edges to `node`.
     pub fn incoming_edges(&self, node: NodeIndex) -> Vec<(EdgeIndex, ThreadId, &EdgeWeight)> {
-        self.graph
-            .edges_directed(node, Direction::Incoming)
-            .map(|e| (e.id(), self.graph[e.source()].tid, e.weight()))
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterate all edges as (EdgeIndex, src_tid, dst_tid, &EdgeWeight).
     /// BTreeMap-ordered by source tid for determinism.
     pub fn all_edges(&self) -> Vec<(EdgeIndex, ThreadId, ThreadId, &EdgeWeight)> {
         let mut result: Vec<_> = self
             .graph
             .edge_indices()

---- scc::heuristic::tests::apply_heuristic_sets_weights stdout ----

thread 'scc::heuristic::tests::apply_heuristic_sets_weights' (288204) panicked at src/scc/heuristic.rs:116:13:
super-node [ThreadId(3)] has zero weight

---- scc::heuristic::tests::heuristic_on_figure4 stdout ----

thread 'scc::heuristic::tests::heuristic_on_figure4' (288206) panicked at src/scc/heuristic.rs:135:9:
assertion `left == right` failed
  left: 0
 right: 80

---- scc::heuristic::tests::singleton_weight_from_incident_edges stdout ----

thread 'scc::heuristic::tests::singleton_weight_from_incident_edges' (288208) panicked at src/scc/heuristic.rs:81:9:
assertion `left == right` failed
  left: 0
 right: 50

failures:
    scc::heuristic::tests::apply_heuristic_sets_weights
    scc::heuristic::tests::heuristic_on_figure4
    scc::heuristic::tests::singleton_weight_from_incident_edges

test result: FAILED. 55 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
