*** src/graph/wfg.rs:77:9: replace WaitForGraph::all_edges -> Vec<(EdgeIndex, ThreadId, ThreadId, &EdgeWeight)> with vec![]

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::all_edges -> Vec<(EdgeIndex, ThreadId, ThreadId, &EdgeWeight)> with vec![]
@@ -69,27 +69,17 @@
             .edges_directed(node, Direction::Incoming)
             .map(|e| (e.id(), self.graph[e.source()].tid, e.weight()))
             .collect()
     }
 
     /// Iterate all edges as (EdgeIndex, src_tid, dst_tid, &EdgeWeight).
     /// BTreeMap-ordered by source tid for determinism.
     pub fn all_edges(&self) -> Vec<(EdgeIndex, ThreadId, ThreadId, &EdgeWeight)> {
-        let mut result: Vec<_> = self
-            .graph
-            .edge_indices()
-            .map(|eidx| {
-                let (src, dst) = self.graph.edge_endpoints(eidx).unwrap();
-                (eidx, self.graph[src].tid, self.graph[dst].tid, &self.graph[eidx])
-            })
-            .collect();
-        // Sort by (src_tid, dst_tid) for determinism
-        result.sort_by_key(|(_, s, d, _)| (*s, *d));
-        result
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total number of nodes.
     pub fn node_count(&self) -> usize {
         self.graph.node_count()
     }
 
     /// Total number of edges.

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (289254) panicked at src/cascade/engine.rs:182:100:
called `Option::unwrap()` on a `None` value

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (289253) panicked at src/cascade/engine.rs:205:91:
called `Option::unwrap()` on a `None` value

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (289255) panicked at src/cascade/engine.rs:222:103:
called `Option::unwrap()` on a `None` value

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_single_edge
    cascade::invariants::tests::conservation_detects_amplification
    cascade::invariants::tests::conservation_detects_locality_violation
    cascade::invariants::tests::locality_detects_extra_edge
    cascade::invariants::tests::locality_detects_window_change
    cascade::invariants::tests::non_amplification_detects_violation
    critical_path::tests::branching_picks_heavier_path
    critical_path::tests::figure4_critical_path
    critical_path::tests::long_chain_linear_complexity

test result: FAILED. 37 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
