*** src/graph/wfg.rs:92:9: replace WaitForGraph::node_count -> usize with 1

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::node_count -> usize with 1
@@ -84,17 +84,17 @@
             .collect();
         // Sort by (src_tid, dst_tid) for determinism
         result.sort_by_key(|(_, s, d, _)| (*s, *d));
         result
     }
 
     /// Total number of nodes.
     pub fn node_count(&self) -> usize {
-        self.graph.node_count()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total number of edges.
     pub fn edge_count(&self) -> usize {
         self.graph.edge_count()
     }
 
     /// Get edge weight by index.

---- graph::wfg::tests::add_nodes_and_edges stdout ----

thread 'graph::wfg::tests::add_nodes_and_edges' (291527) panicked at src/graph/wfg.rs:171:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    graph::wfg::tests::add_nodes_and_edges

test result: FAILED. 57 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
