*** src/graph/wfg.rs:97:9: replace WaitForGraph::edge_count -> usize with 0

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::edge_count -> usize with 0
@@ -89,17 +89,17 @@
 
     /// Total number of nodes.
     pub fn node_count(&self) -> usize {
         self.graph.node_count()
     }
 
     /// Total number of edges.
     pub fn edge_count(&self) -> usize {
-        self.graph.edge_count()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get edge weight by index.
     pub fn edge_weight(&self, idx: EdgeIndex) -> &EdgeWeight {
         &self.graph[idx]
     }
 
     /// Get mutable edge weight by index.

---- graph::wfg::tests::add_nodes_and_edges stdout ----

thread 'graph::wfg::tests::add_nodes_and_edges' (294214) panicked at src/graph/wfg.rs:172:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    graph::wfg::tests::add_nodes_and_edges

test result: FAILED. 57 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
