*** src/cascade/engine.rs:119:51: replace / with % in compute_cascade

*** mutation diff:
--- src/cascade/engine.rs
+++ replace / with % in compute_cascade
@@ -111,17 +111,17 @@
 
             // NEW-BUG-1 FIX: child absorbs interval duration (prop_down + self_blame)
             let child_subtree_absorbed = interval.window.duration();
 
             let external_waiters = count_concurrent_waiters(graph, next_node, &interval.window);
             let scale_target = target_count.max(1);
             let scale_external = external_waiters.max(1);
 
-            let transfer = child_subtree_absorbed / scale_target / scale_external;
+            let transfer = child_subtree_absorbed % /* ~ changed by cargo-mutants ~ */ scale_target / scale_external;
             total_propagated += transfer;
         }
     }
 
     path.remove(&current);
     total_propagated
 }

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (380072) panicked at src/cascade/engine.rs:210:9:
assertion `left == right` failed
  left: 100
 right: 20

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (380073) panicked at src/cascade/engine.rs:186:9:
assertion `left == right` failed: User→Parser
  left: 100
 right: 20

---- cascade::engine::tests::concurrent_waiters_divides_weight stdout ----

thread 'cascade::engine::tests::concurrent_waiters_divides_weight' (380077) panicked at src/cascade/engine.rs:266:9:
assertion `left == right` failed: T1→T2 with 2 waiters on T3
  left: 100
 right: 50

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::idempotency_actually_runs_cascade
    scc::heuristic::tests::heuristic_on_figure4

test result: FAILED. 61 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
