*** src/cascade/engine.rs:119:51: replace / with * in compute_cascade

*** mutation diff:
--- src/cascade/engine.rs
+++ replace / with * in compute_cascade
@@ -111,17 +111,17 @@
 
             // NEW-BUG-1 FIX: child absorbs interval duration (prop_down + self_blame)
             let child_subtree_absorbed = interval.window.duration();
 
             let external_waiters = count_concurrent_waiters(graph, next_node, &interval.window);
             let scale_target = target_count.max(1);
             let scale_external = external_waiters.max(1);
 
-            let transfer = child_subtree_absorbed / scale_target / scale_external;
+            let transfer = child_subtree_absorbed * /* ~ changed by cargo-mutants ~ */ scale_target / scale_external;
             total_propagated += transfer;
         }
     }
 
     path.remove(&current);
     total_propagated
 }

---- bug3_multi_edge_overlap stdout ----

thread 'bug3_multi_edge_overlap' (382500) panicked at tests/bug_regressions.rs:135:5:
BUG-3: sweep-line must prevent double-counting

failures:
    bug3_multi_edge_overlap

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
