*** src/cascade/engine.rs:119:66: replace / with * in compute_cascade

*** mutation diff:
--- src/cascade/engine.rs
+++ replace / with * in compute_cascade
@@ -111,17 +111,17 @@
 
             // NEW-BUG-1 FIX: child absorbs interval duration (prop_down + self_blame)
             let child_subtree_absorbed = interval.window.duration();
 
             let external_waiters = count_concurrent_waiters(graph, next_node, &interval.window);
             let scale_target = target_count.max(1);
             let scale_external = external_waiters.max(1);
 
-            let transfer = child_subtree_absorbed / scale_target / scale_external;
+            let transfer = child_subtree_absorbed / scale_target * /* ~ changed by cargo-mutants ~ */ scale_external;
             total_propagated += transfer;
         }
     }
 
     path.remove(&current);
     total_propagated
 }

---- cascade::engine::tests::concurrent_waiters_divides_weight stdout ----

thread 'cascade::engine::tests::concurrent_waiters_divides_weight' (379893) panicked at src/cascade/engine.rs:266:9:
assertion `left == right` failed: T1→T2 with 2 waiters on T3
  left: 0
 right: 50

failures:
    cascade::engine::tests::concurrent_waiters_divides_weight

test result: FAILED. 67 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
