*** src/cascade/engine.rs:120:30: replace += with -= in compute_cascade

*** mutation diff:
--- src/cascade/engine.rs
+++ replace += with -= in compute_cascade
@@ -112,17 +112,17 @@
             // NEW-BUG-1 FIX: child absorbs interval duration (prop_down + self_blame)
             let child_subtree_absorbed = interval.window.duration();
 
             let external_waiters = count_concurrent_waiters(graph, next_node, &interval.window);
             let scale_target = target_count.max(1);
             let scale_external = external_waiters.max(1);
 
             let transfer = child_subtree_absorbed / scale_target / scale_external;
-            total_propagated += transfer;
+            total_propagated -= /* ~ changed by cargo-mutants ~ */ transfer;
         }
     }
 
     path.remove(&current);
     total_propagated
 }
 
 fn count_concurrent_waiters(

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (382361) panicked at src/cascade/engine.rs:120:13:
attempt to subtract with overflow

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (382365) panicked at src/cascade/engine.rs:120:13:
attempt to subtract with overflow

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (382363) panicked at src/cascade/engine.rs:120:13:
attempt to subtract with overflow

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::is_conserved_false_on_bad_graph
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::depth_monotonicity_passes_on_chain
    cascade::invariants::tests::depth_monotonicity_verified_numerically
    cascade::invariants::tests::idempotency_actually_runs_cascade

test result: FAILED. 51 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
