*** src/cascade/engine.rs:120:30: replace += with *= in compute_cascade

*** mutation diff:
--- src/cascade/engine.rs
+++ replace += with *= in compute_cascade
@@ -112,17 +112,17 @@
             // NEW-BUG-1 FIX: child absorbs interval duration (prop_down + self_blame)
             let child_subtree_absorbed = interval.window.duration();
 
             let external_waiters = count_concurrent_waiters(graph, next_node, &interval.window);
             let scale_target = target_count.max(1);
             let scale_external = external_waiters.max(1);
 
             let transfer = child_subtree_absorbed / scale_target / scale_external;
-            total_propagated += transfer;
+            total_propagated *= /* ~ changed by cargo-mutants ~ */ transfer;
         }
     }
 
     path.remove(&current);
     total_propagated
 }
 
 fn count_concurrent_waiters(

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (382507) panicked at src/cascade/engine.rs:210:9:
assertion `left == right` failed
  left: 100
 right: 20

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (382508) panicked at src/cascade/engine.rs:186:9:
assertion `left == right` failed: User→Parser
  left: 100
 right: 20

---- cascade::engine::tests::depth_limit_changes_result stdout ----

thread 'cascade::engine::tests::depth_limit_changes_result' (382513) panicked at src/cascade/engine.rs:293:9:
depth=10 → cascade reduces attribution

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::idempotency_actually_runs_cascade
    scc::heuristic::tests::heuristic_on_figure4

test result: FAILED. 61 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
