*** src/cascade/engine.rs:35:5: replace cascade_engine -> WaitForGraph with Default::default()

*** mutation diff:
--- src/cascade/engine.rs
+++ replace cascade_engine -> WaitForGraph with Default::default()
@@ -27,55 +27,17 @@
 /// Each edge's `attributed_delay_ms` is set to `raw_wait - propagated`,
 /// where `propagated` is the weight explained by deeper nodes.
 ///
 /// Invariant checks:
 /// - I-2 (non-amplification): attributed ≤ raw per edge — always checked
 /// - I-3 (non-negativity): attributed ≥ 0 — trivially true for u64
 /// - I-7 (locality): checked in debug builds
 pub fn cascade_engine(graph: &WaitForGraph, max_depth: Option<u32>) -> WaitForGraph {
-    let max_depth = max_depth.unwrap_or(DEFAULT_MAX_DEPTH);
-
-    let mut attribution: BTreeMap<EdgeIndex, u64> = BTreeMap::new();
-
-    for (eidx, src_tid, dst_tid, ew) in graph.all_edges() {
-        let window = ew.time_window;
-        let raw_wait = ew.raw_wait_ms;
-
-        let mut path = BTreeSet::new();
-        path.insert(src_tid);
-
-        let propagated =
-            compute_cascade(graph, dst_tid, &window, 1, max_depth, &mut path);
-
-        let attributed = raw_wait.saturating_sub(propagated);
-        attribution.insert(eidx, attributed);
-    }
-
-    let mut result = graph.clone_with_reset_attribution();
-    for (eidx, attributed) in &attribution {
-        result.edge_weight_mut(*eidx).attributed_delay_ms = *attributed;
-    }
-
-    // I-1: Weight Conservation — production sentinel (always runs)
-    invariants::assert_weight_conserved(graph, &result);
-
-    // I-3: Non-negativity (trivially true for u64, documents intent)
-    debug_assert!(
-        invariants::check_non_negativity(&result),
-        "I-3 VIOLATION: negative attributed delay"
-    );
-
-    // I-4: Termination (topology preserved)
-    debug_assert!(
-        invariants::check_termination(graph, &result),
-        "I-4 VIOLATION: cascade changed graph topology"
-    );
-
-    result
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Check if the cascade result is conserved (non-panicking).
 /// Delegates to invariants::is_conserved (I-2 + I-7).
 pub fn is_conserved(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     invariants::is_conserved(original, result)
 }

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (372999) panicked at src/cascade/engine.rs:144:100:
called `Option::unwrap()` on a `None` value

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (373000) panicked at src/cascade/engine.rs:184:103:
called `Option::unwrap()` on a `None` value

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (372998) panicked at src/cascade/engine.rs:167:91:
called `Option::unwrap()` on a `None` value

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::is_conserved_false_on_bad_graph
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::assert_weight_conserved_returns_true_on_valid
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::idempotency_actually_runs_cascade

test result: FAILED. 50 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
