*** src/cascade/engine.rs:79:5: replace is_conserved -> bool with true

*** mutation diff:
--- src/cascade/engine.rs
+++ replace is_conserved -> bool with true
@@ -71,17 +71,17 @@
     );
 
     result
 }
 
 /// Check if the cascade result is conserved (non-panicking).
 /// Delegates to invariants::is_conserved (I-2 + I-7).
 pub fn is_conserved(original: &WaitForGraph, result: &WaitForGraph) -> bool {
-    invariants::is_conserved(original, result)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Recursive cascade computation (ADR-007 pseudocode).
 /// Returns total weight propagated to deeper nodes.
 fn compute_cascade(
     graph: &WaitForGraph,
     current: ThreadId,
     window: &TimeWindow,

---- cascade::engine::tests::is_conserved_false_on_bad_graph stdout ----

thread 'cascade::engine::tests::is_conserved_false_on_bad_graph' (372591) panicked at src/cascade/engine.rs:241:9:
assertion failed: !is_conserved(&g, &result)

failures:
    cascade::engine::tests::is_conserved_false_on_bad_graph

test result: FAILED. 67 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
