*** src/cascade/engine.rs:92:27: replace || with && in compute_cascade

*** mutation diff:
--- src/cascade/engine.rs
+++ replace || with && in compute_cascade
@@ -84,17 +84,17 @@
 fn compute_cascade(
     graph: &WaitForGraph,
     current: ThreadId,
     window: &TimeWindow,
     depth: u32,
     max_depth: u32,
     path: &mut BTreeSet<ThreadId>,
 ) -> u64 {
-    if depth >= max_depth || path.contains(&current) {
+    if depth >= max_depth && /* ~ changed by cargo-mutants ~ */ path.contains(&current) {
         return 0;
     }
 
     let intervals = sweep_line_partition(graph, current, window);
     if intervals.is_empty() {
         return 0;
     }

---- cascade::engine::tests::depth_limit_changes_result stdout ----

thread 'cascade::engine::tests::depth_limit_changes_result' (375005) panicked at src/cascade/engine.rs:291:9:
assertion `left == right` failed: depth=1 → no cascade
  left: 0
 right: 100

failures:
    cascade::engine::tests::depth_limit_changes_result

test result: FAILED. 67 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
