*** src/cascade/invariants.rs:102:5: replace check_idempotency -> bool with true

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace check_idempotency -> bool with true
@@ -94,32 +94,17 @@
 
     true
 }
 
 /// I-5: Idempotency.
 /// cascade(cascade(G)) == cascade(G).
 /// Test-only — running cascade twice is expensive.
 pub fn check_idempotency(graph: &WaitForGraph, max_depth: u32) -> bool {
-    use super::engine::cascade_engine;
-
-    let first = cascade_engine(graph, Some(max_depth));
-    let second = cascade_engine(&first, Some(max_depth));
-
-    // Compare all attributed_delay_ms values
-    let e1 = first.all_edges();
-    let e2 = second.all_edges();
-
-    if e1.len() != e2.len() {
-        return false;
-    }
-
-    e1.iter()
-        .zip(e2.iter())
-        .all(|(a, b)| a.3.attributed_delay_ms == b.3.attributed_delay_ms)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// I-6: Depth monotonicity.
 /// Increasing max_depth propagates more weight downstream, so
 /// total_attributed(deep) ≤ total_attributed(shallow).
 /// Test-only — runs cascade at two depths.
 pub fn check_depth_monotonicity(graph: &WaitForGraph) -> bool {
     use super::engine::cascade_engine;

*** result: Success
