*** src/cascade/invariants.rs:102:5: replace check_idempotency -> bool with false

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace check_idempotency -> bool with false
@@ -94,32 +94,17 @@
 
     true
 }
 
 /// I-5: Idempotency.
 /// cascade(cascade(G)) == cascade(G).
 /// Test-only — running cascade twice is expensive.
 pub fn check_idempotency(graph: &WaitForGraph, max_depth: u32) -> bool {
-    use super::engine::cascade_engine;
-
-    let first = cascade_engine(graph, Some(max_depth));
-    let second = cascade_engine(&first, Some(max_depth));
-
-    // Compare all attributed_delay_ms values
-    let e1 = first.all_edges();
-    let e2 = second.all_edges();
-
-    if e1.len() != e2.len() {
-        return false;
-    }
-
-    e1.iter()
-        .zip(e2.iter())
-        .all(|(a, b)| a.3.attributed_delay_ms == b.3.attributed_delay_ms)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// I-6: Depth monotonicity.
 /// Increasing max_depth propagates more weight downstream, so
 /// total_attributed(deep) ≤ total_attributed(shallow).
 /// Test-only — runs cascade at two depths.
 pub fn check_depth_monotonicity(graph: &WaitForGraph) -> bool {
     use super::engine::cascade_engine;

---- cascade::invariants::tests::idempotency_passes_on_figure4 stdout ----

thread 'cascade::invariants::tests::idempotency_passes_on_figure4' (407661) panicked at src/cascade/invariants.rs:242:9:
assertion failed: check_idempotency(&g, 10)

---- cascade::invariants::tests::idempotency_actually_runs_cascade stdout ----

thread 'cascade::invariants::tests::idempotency_actually_runs_cascade' (407660) panicked at src/cascade/invariants.rs:341:9:
assertion failed: check_idempotency(&g, 10)

failures:
    cascade::invariants::tests::idempotency_actually_runs_cascade
    cascade::invariants::tests::idempotency_passes_on_figure4

test result: FAILED. 66 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
