*** src/cascade/invariants.rs:111:17: replace != with == in check_idempotency

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace != with == in check_idempotency
@@ -103,17 +103,17 @@
 
     let first = cascade_engine(graph, Some(max_depth));
     let second = cascade_engine(&first, Some(max_depth));
 
     // Compare all attributed_delay_ms values
     let e1 = first.all_edges();
     let e2 = second.all_edges();
 
-    if e1.len() != e2.len() {
+    if e1.len() == /* ~ changed by cargo-mutants ~ */ e2.len() {
         return false;
     }
 
     e1.iter()
         .zip(e2.iter())
         .all(|(a, b)| a.3.attributed_delay_ms == b.3.attributed_delay_ms)
 }

---- cascade::invariants::tests::idempotency_passes_on_figure4 stdout ----

thread 'cascade::invariants::tests::idempotency_passes_on_figure4' (407770) panicked at src/cascade/invariants.rs:257:9:
assertion failed: check_idempotency(&g, 10)

---- cascade::invariants::tests::idempotency_actually_runs_cascade stdout ----

thread 'cascade::invariants::tests::idempotency_actually_runs_cascade' (407769) panicked at src/cascade/invariants.rs:356:9:
assertion failed: check_idempotency(&g, 10)

failures:
    cascade::invariants::tests::idempotency_actually_runs_cascade
    cascade::invariants::tests::idempotency_passes_on_figure4

test result: FAILED. 66 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
