*** src/cascade/invariants.rs:125:5: replace check_depth_monotonicity -> bool with true

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace check_depth_monotonicity -> bool with true
@@ -117,22 +117,17 @@
         .all(|(a, b)| a.3.attributed_delay_ms == b.3.attributed_delay_ms)
 }
 
 /// I-6: Depth monotonicity.
 /// Increasing max_depth propagates more weight downstream, so
 /// total_attributed(deep) ≤ total_attributed(shallow).
 /// Test-only — runs cascade at two depths.
 pub fn check_depth_monotonicity(graph: &WaitForGraph) -> bool {
-    use super::engine::cascade_engine;
-
-    let shallow = cascade_engine(graph, Some(2));
-    let deep = cascade_engine(graph, Some(10));
-
-    deep.total_attributed() <= shallow.total_attributed()
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::graph::types::*;
 
     #[test]

*** result: Success
