*** src/cascade/invariants.rs:125:5: replace check_depth_monotonicity -> bool with false

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace check_depth_monotonicity -> bool with false
@@ -117,22 +117,17 @@
         .all(|(a, b)| a.3.attributed_delay_ms == b.3.attributed_delay_ms)
 }
 
 /// I-6: Depth monotonicity.
 /// Increasing max_depth propagates more weight downstream, so
 /// total_attributed(deep) ≤ total_attributed(shallow).
 /// Test-only — runs cascade at two depths.
 pub fn check_depth_monotonicity(graph: &WaitForGraph) -> bool {
-    use super::engine::cascade_engine;
-
-    let shallow = cascade_engine(graph, Some(2));
-    let deep = cascade_engine(graph, Some(10));
-
-    deep.total_attributed() <= shallow.total_attributed()
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::graph::types::*;
 
     #[test]

---- cascade::invariants::tests::depth_monotonicity_verified_numerically stdout ----

thread 'cascade::invariants::tests::depth_monotonicity_verified_numerically' (410203) panicked at src/cascade/invariants.rs:368:9:
assertion failed: check_depth_monotonicity(&g)

---- cascade::invariants::tests::depth_monotonicity_passes_on_chain stdout ----

thread 'cascade::invariants::tests::depth_monotonicity_passes_on_chain' (410202) panicked at src/cascade/invariants.rs:266:9:
assertion failed: check_depth_monotonicity(&g)

failures:
    cascade::invariants::tests::depth_monotonicity_passes_on_chain
    cascade::invariants::tests::depth_monotonicity_verified_numerically

test result: FAILED. 66 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
