*** src/cascade/invariants.rs:130:29: replace <= with > in check_depth_monotonicity

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace <= with > in check_depth_monotonicity
@@ -122,17 +122,17 @@
 /// total_attributed(deep) ≤ total_attributed(shallow).
 /// Test-only — runs cascade at two depths.
 pub fn check_depth_monotonicity(graph: &WaitForGraph) -> bool {
     use super::engine::cascade_engine;
 
     let shallow = cascade_engine(graph, Some(2));
     let deep = cascade_engine(graph, Some(10));
 
-    deep.total_attributed() <= shallow.total_attributed()
+    deep.total_attributed() > /* ~ changed by cargo-mutants ~ */ shallow.total_attributed()
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::graph::types::*;
 
     #[test]

---- cascade::invariants::tests::depth_monotonicity_passes_on_chain stdout ----

thread 'cascade::invariants::tests::depth_monotonicity_passes_on_chain' (410305) panicked at src/cascade/invariants.rs:271:9:
assertion failed: check_depth_monotonicity(&g)

---- cascade::invariants::tests::depth_monotonicity_verified_numerically stdout ----

thread 'cascade::invariants::tests::depth_monotonicity_verified_numerically' (410306) panicked at src/cascade/invariants.rs:373:9:
assertion failed: check_depth_monotonicity(&g)

failures:
    cascade::invariants::tests::depth_monotonicity_passes_on_chain
    cascade::invariants::tests::depth_monotonicity_verified_numerically

test result: FAILED. 66 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
