*** src/cascade/invariants.rs:27:24: replace && with || in assert_weight_conserved

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace && with || in assert_weight_conserved
@@ -19,17 +19,17 @@
 }
 
 /// I-1 enforcement: call after every cascade run.
 /// Panics in debug builds, logs warning in release builds.
 /// Returns the conservation status.
 pub fn assert_weight_conserved(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     let i2 = check_non_amplification(result);
     let i7 = check_locality(original, result);
-    let conserved = i2 && i7;
+    let conserved = i2 || /* ~ changed by cargo-mutants ~ */ i7;
 
     if !conserved {
         if cfg!(debug_assertions) {
             panic!(
                 "I-1 VIOLATION: conservation check failed (I-2={}, I-7={})",
                 i2, i7
             );
         } else {

*** result: Success
