*** src/cascade/invariants.rs:29:8: delete ! in assert_weight_conserved

*** mutation diff:
--- src/cascade/invariants.rs
+++ delete ! in assert_weight_conserved
@@ -21,17 +21,17 @@
 /// I-1 enforcement: call after every cascade run.
 /// Panics in debug builds, logs warning in release builds.
 /// Returns the conservation status.
 pub fn assert_weight_conserved(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     let i2 = check_non_amplification(result);
     let i7 = check_locality(original, result);
     let conserved = i2 && i7;
 
-    if !conserved {
+    if  /* ~ changed by cargo-mutants ~ */conserved {
         if cfg!(debug_assertions) {
             panic!(
                 "I-1 VIOLATION: conservation check failed (I-2={}, I-7={})",
                 i2, i7
             );
         } else {
             eprintln!(
                 "[wperf] WARNING: I-1 violation (I-2={}, I-7={})",

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (391314) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=true)

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (391316) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=true)

---- cascade::engine::tests::cascade_no_amplification stdout ----

thread 'cascade::engine::tests::cascade_no_amplification' (391317) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=true)

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::is_conserved_false_on_bad_graph
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::assert_weight_conserved_returns_true_on_valid
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::depth_monotonicity_passes_on_chain

test result: FAILED. 46 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
