*** src/cascade/invariants.rs:52:53: replace <= with > in check_non_amplification

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace <= with > in check_non_amplification
@@ -44,17 +44,17 @@
 }
 
 /// I-2: Non-amplification.
 /// No edge's attributed_delay_ms may exceed its raw_wait_ms.
 pub fn check_non_amplification(result: &WaitForGraph) -> bool {
     result
         .all_edges()
         .iter()
-        .all(|(_, _, _, ew)| ew.attributed_delay_ms <= ew.raw_wait_ms)
+        .all(|(_, _, _, ew)| ew.attributed_delay_ms > /* ~ changed by cargo-mutants ~ */ ew.raw_wait_ms)
 }
 
 /// I-3: Non-negativity.
 /// All attributed_delay_ms >= 0. Trivially true for u64, but documents intent.
 pub fn check_non_negativity(_result: &WaitForGraph) -> bool {
     true // u64 is always >= 0
 }

---- cascade::engine::tests::cascade_single_edge stdout ----

thread 'cascade::engine::tests::cascade_single_edge' (393158) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=false, I-7=true)

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (393156) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=false, I-7=true)

---- cascade::engine::tests::cascade_no_amplification stdout ----

thread 'cascade::engine::tests::cascade_no_amplification' (393157) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=false, I-7=true)

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::is_conserved_false_on_bad_graph
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::assert_weight_conserved_returns_true_on_valid
    cascade::invariants::tests::conservation_detects_amplification
    cascade::invariants::tests::conservation_passes_on_cascade_result

test result: FAILED. 42 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
