*** src/cascade/invariants.rs:65:27: replace == with != in check_termination

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace == with != in check_termination
@@ -57,17 +57,17 @@
 pub fn check_non_negativity(_result: &WaitForGraph) -> bool {
     true // u64 is always >= 0
 }
 
 /// I-4: Termination.
 /// Cascade must not create or remove nodes/edges.
 /// The topology of the result must match the original.
 pub fn check_termination(original: &WaitForGraph, result: &WaitForGraph) -> bool {
-    original.node_count() == result.node_count()
+    original.node_count() != /* ~ changed by cargo-mutants ~ */ result.node_count()
         && original.edge_count() == result.edge_count()
 }
 
 /// I-7: Locality.
 /// Every edge in result must correspond to an edge in original with
 /// the same (src, dst) and time_window.
 pub fn check_locality(original: &WaitForGraph, result: &WaitForGraph) -> bool {
     let orig_edges = original.all_edges();

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (398098) panicked at src/cascade/engine.rs:68:5:
I-4 VIOLATION: cascade changed graph topology

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (398097) panicked at src/cascade/engine.rs:68:5:
I-4 VIOLATION: cascade changed graph topology

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (398096) panicked at src/cascade/engine.rs:68:5:
I-4 VIOLATION: cascade changed graph topology

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::is_conserved_false_on_bad_graph
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::assert_weight_conserved_returns_true_on_valid
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::depth_monotonicity_passes_on_chain

test result: FAILED. 44 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
