*** src/cascade/invariants.rs:73:5: replace check_locality -> bool with false

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace check_locality -> bool with false
@@ -65,39 +65,17 @@
     original.node_count() == result.node_count()
         && original.edge_count() == result.edge_count()
 }
 
 /// I-7: Locality.
 /// Every edge in result must correspond to an edge in original with
 /// the same (src, dst) and time_window.
 pub fn check_locality(original: &WaitForGraph, result: &WaitForGraph) -> bool {
-    let orig_edges = original.all_edges();
-    let res_edges = result.all_edges();
-
-    if orig_edges.len() != res_edges.len() {
-        return false;
-    }
-
-    for (orig, res) in orig_edges.iter().zip(res_edges.iter()) {
-        // Same endpoints
-        if orig.1 != res.1 || orig.2 != res.2 {
-            return false;
-        }
-        // Same time window
-        if orig.3.time_window != res.3.time_window {
-            return false;
-        }
-        // Same raw_wait
-        if orig.3.raw_wait_ms != res.3.raw_wait_ms {
-            return false;
-        }
-    }
-
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// I-5: Idempotency.
 /// cascade(cascade(G)) == cascade(G).
 /// Test-only — running cascade twice is expensive.
 pub fn check_idempotency(graph: &WaitForGraph, max_depth: u32) -> bool {
     use super::engine::cascade_engine;

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (401141) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (401143) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

---- cascade::engine::tests::cascade_no_amplification stdout ----

thread 'cascade::engine::tests::cascade_no_amplification' (401148) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::is_conserved_false_on_bad_graph
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::assert_weight_conserved_returns_true_on_valid
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::conservation_passes_on_identity

test result: FAILED. 44 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
