*** src/cascade/invariants.rs:82:38: replace != with == in check_locality

*** mutation diff:
--- src/cascade/invariants.rs
+++ replace != with == in check_locality
@@ -74,17 +74,17 @@
     let res_edges = result.all_edges();
 
     if orig_edges.len() != res_edges.len() {
         return false;
     }
 
     for (orig, res) in orig_edges.iter().zip(res_edges.iter()) {
         // Same endpoints
-        if orig.1 != res.1 || orig.2 != res.2 {
+        if orig.1 != res.1 || orig.2 == /* ~ changed by cargo-mutants ~ */ res.2 {
             return false;
         }
         // Same time window
         if orig.3.time_window != res.3.time_window {
             return false;
         }
         // Same raw_wait
         if orig.3.raw_wait_ms != res.3.raw_wait_ms {

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (405111) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (405112) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (405110) panicked at src/cascade/invariants.rs:31:13:
I-1 VIOLATION: conservation check failed (I-2=true, I-7=false)

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::is_conserved_false_on_bad_graph
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::assert_weight_conserved_returns_true_on_valid
    cascade::invariants::tests::conservation_passes_on_cascade_result
    cascade::invariants::tests::conservation_passes_on_identity

test result: FAILED. 44 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
