*** src/graph/sweep.rs:30:5: replace sweep_line_partition -> Vec<ElementaryInterval> with vec![]

*** mutation diff:
--- src/graph/sweep.rs
+++ replace sweep_line_partition -> Vec<ElementaryInterval> with vec![]
@@ -22,73 +22,17 @@
 ///    ElementaryInterval listing active targets
 ///
 /// Returns empty Vec if no outgoing edges overlap `window`.
 pub fn sweep_line_partition(
     graph: &WaitForGraph,
     node: ThreadId,
     window: &TimeWindow,
 ) -> Vec<ElementaryInterval> {
-    let node_idx = match graph.node_index(&node) {
-        Some(idx) => idx,
-        None => return Vec::new(),
-    };
-
-    // Collect clipped intervals: (clipped_window, target_tid)
-    let mut clipped: Vec<(TimeWindow, ThreadId)> = Vec::new();
-    for edge_ref in graph.graph.edges_directed(node_idx, Direction::Outgoing) {
-        let ew = edge_ref.weight();
-        if let Some(overlap) = window.overlap(&ew.time_window) {
-            let target_tid = graph.graph[edge_ref.target()].tid;
-            clipped.push((overlap, target_tid));
-        }
-    }
-
-    if clipped.is_empty() {
-        return Vec::new();
-    }
-
-    // Collect all distinct boundary points
-    let mut points = BTreeSet::new();
-    for (w, _) in &clipped {
-        points.insert(w.start_ms);
-        points.insert(w.end_ms);
-    }
-    let points: Vec<u64> = points.into_iter().collect(); // already sorted (BTreeSet)
-
-    // Sweep: for each consecutive pair, find active targets
-    let mut result = Vec::new();
-    for pair in points.windows(2) {
-        let (s, e) = (pair[0], pair[1]);
-        if s >= e {
-            continue;
-        }
-        let sub = TimeWindow::new(s, e);
-
-        // Targets active during this sub-interval
-        let mut targets: Vec<ThreadId> = clipped
-            .iter()
-            .filter(|(w, _)| w.start_ms <= s && w.end_ms >= e)
-            .map(|(_, tid)| *tid)
-            .collect();
-
-        if targets.is_empty() {
-            continue;
-        }
-
-        targets.sort(); // deterministic order
-        targets.dedup();
-
-        result.push(ElementaryInterval {
-            window: sub,
-            targets,
-        });
-    }
-
-    result
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::graph::types::NodeKind;
 
     fn make_graph_with_outgoing(

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (368656) panicked at src/cascade/engine.rs:210:9:
assertion `left == right` failed
  left: 100
 right: 20

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (368657) panicked at src/cascade/engine.rs:186:9:
assertion `left == right` failed: User→Parser
  left: 100
 right: 20

---- cascade::engine::tests::concurrent_waiters_divides_weight stdout ----

thread 'cascade::engine::tests::concurrent_waiters_divides_weight' (368661) panicked at src/cascade/engine.rs:266:9:
assertion `left == right` failed: T1→T2 with 2 waiters on T3
  left: 100
 right: 50

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::idempotency_actually_runs_cascade
    graph::sweep::tests::non_overlapping_edges
    graph::sweep::tests::single_edge_full_overlap
    graph::sweep::tests::single_edge_partial_overlap
    graph::sweep::tests::total_coverage_equals_sum_of_intervals
    graph::sweep::tests::two_overlapping_edges
    scc::heuristic::tests::heuristic_on_figure4

test result: FAILED. 56 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
