*** src/graph/sweep.rs:69:46: replace && with || in sweep_line_partition

*** mutation diff:
--- src/graph/sweep.rs
+++ replace && with || in sweep_line_partition
@@ -61,17 +61,17 @@
         if s >= e {
             continue;
         }
         let sub = TimeWindow::new(s, e);
 
         // Targets active during this sub-interval
         let mut targets: Vec<ThreadId> = clipped
             .iter()
-            .filter(|(w, _)| w.start_ms <= s && w.end_ms >= e)
+            .filter(|(w, _)| w.start_ms <= s || /* ~ changed by cargo-mutants ~ */ w.end_ms >= e)
             .map(|(_, tid)| *tid)
             .collect();
 
         if targets.is_empty() {
             continue;
         }
 
         targets.sort(); // deterministic order

---- graph::sweep::tests::non_overlapping_edges stdout ----

thread 'graph::sweep::tests::non_overlapping_edges' (368604) panicked at src/graph/sweep.rs:164:9:
assertion `left == right` failed
  left: 3
 right: 2

---- graph::sweep::tests::two_overlapping_edges stdout ----

thread 'graph::sweep::tests::two_overlapping_edges' (368608) panicked at src/graph/sweep.rs:146:9:
assertion `left == right` failed
  left: [ThreadId(2), ThreadId(3)]
 right: [ThreadId(2)]

failures:
    graph::sweep::tests::non_overlapping_edges
    graph::sweep::tests::two_overlapping_edges

test result: FAILED. 66 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
