*** src/graph/sweep.rs:69:58: replace >= with < in sweep_line_partition

*** mutation diff:
--- src/graph/sweep.rs
+++ replace >= with < in sweep_line_partition
@@ -61,17 +61,17 @@
         if s >= e {
             continue;
         }
         let sub = TimeWindow::new(s, e);
 
         // Targets active during this sub-interval
         let mut targets: Vec<ThreadId> = clipped
             .iter()
-            .filter(|(w, _)| w.start_ms <= s && w.end_ms >= e)
+            .filter(|(w, _)| w.start_ms <= s && w.end_ms < /* ~ changed by cargo-mutants ~ */ e)
             .map(|(_, tid)| *tid)
             .collect();
 
         if targets.is_empty() {
             continue;
         }
 
         targets.sort(); // deterministic order

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (370343) panicked at src/cascade/engine.rs:210:9:
assertion `left == right` failed
  left: 100
 right: 20

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (370344) panicked at src/cascade/engine.rs:186:9:
assertion `left == right` failed: User→Parser
  left: 100
 right: 20

---- cascade::engine::tests::concurrent_waiters_divides_weight stdout ----

thread 'cascade::engine::tests::concurrent_waiters_divides_weight' (370348) panicked at src/cascade/engine.rs:266:9:
assertion `left == right` failed: T1→T2 with 2 waiters on T3
  left: 100
 right: 50

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::idempotency_actually_runs_cascade
    graph::sweep::tests::non_overlapping_edges
    graph::sweep::tests::single_edge_full_overlap
    graph::sweep::tests::single_edge_partial_overlap
    graph::sweep::tests::total_coverage_equals_sum_of_intervals
    graph::sweep::tests::two_overlapping_edges
    scc::heuristic::tests::heuristic_on_figure4

test result: FAILED. 56 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
