*** src/graph/wfg.rs:123:9: replace WaitForGraph::clone_with_reset_attribution -> Self with Default::default()

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::clone_with_reset_attribution -> Self with Default::default()
@@ -115,30 +115,17 @@
     /// All node indices, sorted by ThreadId for determinism.
     pub fn node_indices(&self) -> Vec<NodeIndex> {
         self.node_map.values().copied().collect()
     }
 
     /// Clone the graph structure with the same topology but reset
     /// attributed_delay_ms to raw_wait_ms on all edges.
     pub fn clone_with_reset_attribution(&self) -> Self {
-        let mut new = Self::new();
-        // Clone nodes
-        for (&tid, &_idx) in &self.node_map {
-            new.add_node(tid, self.graph[_idx].kind);
-        }
-        // Clone edges
-        for eidx in self.graph.edge_indices() {
-            let (src, dst) = self.graph.edge_endpoints(eidx).unwrap();
-            let src_tid = self.graph[src].tid;
-            let dst_tid = self.graph[dst].tid;
-            let weight = &self.graph[eidx];
-            new.add_edge(src_tid, dst_tid, weight.time_window);
-        }
-        new
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sum of all raw_wait_ms across all edges.
     pub fn total_raw_wait(&self) -> u64 {
         self.graph.edge_indices().map(|e| self.graph[e].raw_wait_ms).sum()
     }
 
     /// Sum of all attributed_delay_ms across all edges.

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (365881) panicked at src/graph/wfg.rs:107:24:
index out of bounds: the len is 0 but the index is 0

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (365879) panicked at src/graph/wfg.rs:107:24:
index out of bounds: the len is 0 but the index is 0

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (365880) panicked at src/graph/wfg.rs:107:24:
index out of bounds: the len is 0 but the index is 0

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::is_conserved_false_on_bad_graph
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::assert_weight_conserved_returns_true_on_valid
    cascade::invariants::tests::conservation_detects_amplification
    cascade::invariants::tests::conservation_detects_locality_violation

test result: FAILED. 39 passed; 29 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
