*** src/graph/wfg.rs:141:9: replace WaitForGraph::total_raw_wait -> u64 with 0

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::total_raw_wait -> u64 with 0
@@ -133,17 +133,17 @@
             let weight = &self.graph[eidx];
             new.add_edge(src_tid, dst_tid, weight.time_window);
         }
         new
     }
 
     /// Sum of all raw_wait_ms across all edges.
     pub fn total_raw_wait(&self) -> u64 {
-        self.graph.edge_indices().map(|e| self.graph[e].raw_wait_ms).sum()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sum of all attributed_delay_ms across all edges.
     pub fn total_attributed(&self) -> u64 {
         self.graph.edge_indices().map(|e| self.graph[e].attributed_delay_ms).sum()
     }
 }

---- cascade::engine::tests::total_attributed_less_than_raw stdout ----

thread 'cascade::engine::tests::total_attributed_less_than_raw' (363273) panicked at src/cascade/engine.rs:301:9:
assertion failed: result.total_attributed() < g.total_raw_wait()

---- graph::wfg::tests::total_raw_wait stdout ----

thread 'graph::wfg::tests::total_raw_wait' (363313) panicked at src/graph/wfg.rs:188:9:
assertion `left == right` failed
  left: 0
 right: 100

failures:
    cascade::engine::tests::total_attributed_less_than_raw
    graph::wfg::tests::total_raw_wait

test result: FAILED. 66 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
