*** src/graph/wfg.rs:33:9: replace WaitForGraph::add_node -> NodeIndex with Default::default()

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::add_node -> NodeIndex with Default::default()
@@ -25,22 +25,17 @@
             graph: DiGraph::new(),
             node_map: BTreeMap::new(),
         }
     }
 
     /// Add a node (thread). Returns the NodeIndex. Idempotent — returns
     /// existing index if tid already present.
     pub fn add_node(&mut self, tid: ThreadId, kind: NodeKind) -> NodeIndex {
-        if let Some(&idx) = self.node_map.get(&tid) {
-            return idx;
-        }
-        let idx = self.graph.add_node(NodeWeight { tid, kind });
-        self.node_map.insert(tid, idx);
-        idx
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Add a directed edge: `src` waits for `dst` during `window`.
     pub fn add_edge(&mut self, src: ThreadId, dst: ThreadId, window: TimeWindow) -> EdgeIndex {
         let src_idx = *self.node_map.get(&src).expect("src node not in graph");
         let dst_idx = *self.node_map.get(&dst).expect("dst node not in graph");
         self.graph.add_edge(src_idx, dst_idx, EdgeWeight::new(window))
     }

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (351325) panicked at src/graph/wfg.rs:38:48:
src node not in graph

---- cascade::engine::tests::cascade_no_amplification stdout ----

thread 'cascade::engine::tests::cascade_no_amplification' (351329) panicked at src/graph/wfg.rs:38:48:
src node not in graph

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (351327) panicked at src/graph/wfg.rs:38:48:
src node not in graph

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_no_amplification
    cascade::engine::tests::cascade_single_edge
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::is_conserved_false_on_bad_graph
    cascade::engine::tests::node_indices_returns_all_nodes
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::assert_weight_conserved_returns_true_on_valid
    cascade::invariants::tests::conservation_detects_amplification

test result: FAILED. 7 passed; 61 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
