*** src/graph/wfg.rs:43:9: replace WaitForGraph::add_edge -> EdgeIndex with Default::default()

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::add_edge -> EdgeIndex with Default::default()
@@ -35,19 +35,17 @@
         }
         let idx = self.graph.add_node(NodeWeight { tid, kind });
         self.node_map.insert(tid, idx);
         idx
     }
 
     /// Add a directed edge: `src` waits for `dst` during `window`.
     pub fn add_edge(&mut self, src: ThreadId, dst: ThreadId, window: TimeWindow) -> EdgeIndex {
-        let src_idx = *self.node_map.get(&src).expect("src node not in graph");
-        let dst_idx = *self.node_map.get(&dst).expect("dst node not in graph");
-        self.graph.add_edge(src_idx, dst_idx, EdgeWeight::new(window))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the ThreadId for a NodeIndex.
     pub fn thread_id(&self, idx: NodeIndex) -> ThreadId {
         self.graph[idx].tid
     }
 
     /// Get NodeIndex for a ThreadId.

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (360496) panicked at src/cascade/engine.rs:182:100:
called `Option::unwrap()` on a `None` value

---- cascade::engine::tests::cascade_leaf_nonzero stdout ----

thread 'cascade::engine::tests::cascade_leaf_nonzero' (360497) panicked at src/cascade/engine.rs:222:103:
called `Option::unwrap()` on a `None` value

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (360495) panicked at src/cascade/engine.rs:205:91:
called `Option::unwrap()` on a `None` value

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::cascade_leaf_nonzero
    cascade::engine::tests::cascade_single_edge
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::is_conserved_false_on_bad_graph
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::conservation_detects_amplification
    cascade::invariants::tests::conservation_detects_locality_violation
    cascade::invariants::tests::idempotency_actually_runs_cascade
    cascade::invariants::tests::locality_detects_extra_edge

test result: FAILED. 28 passed; 40 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
