*** src/graph/wfg.rs:55:9: replace WaitForGraph::node_index -> Option<NodeIndex> with None

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::node_index -> Option<NodeIndex> with None
@@ -47,17 +47,17 @@
 
     /// Get the ThreadId for a NodeIndex.
     pub fn thread_id(&self, idx: NodeIndex) -> ThreadId {
         self.graph[idx].tid
     }
 
     /// Get NodeIndex for a ThreadId.
     pub fn node_index(&self, tid: &ThreadId) -> Option<NodeIndex> {
-        self.node_map.get(tid).copied()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get all outgoing edges from `node` as (EdgeIndex, dst_ThreadId, &EdgeWeight).
     pub fn outgoing_edges(&self, node: NodeIndex) -> Vec<(EdgeIndex, ThreadId, &EdgeWeight)> {
         self.graph
             .edges_directed(node, Direction::Outgoing)
             .map(|e| (e.id(), self.graph[e.target()].tid, e.weight()))
             .collect()

---- cascade::engine::tests::cascade_extended_3node stdout ----

thread 'cascade::engine::tests::cascade_extended_3node' (360362) panicked at src/cascade/engine.rs:210:9:
assertion `left == right` failed
  left: 100
 right: 20

---- cascade::engine::tests::cascade_figure4 stdout ----

thread 'cascade::engine::tests::cascade_figure4' (360363) panicked at src/cascade/engine.rs:186:9:
assertion `left == right` failed: User→Parser
  left: 100
 right: 20

---- cascade::engine::tests::concurrent_waiters_divides_weight stdout ----

thread 'cascade::engine::tests::concurrent_waiters_divides_weight' (360367) panicked at src/cascade/engine.rs:266:9:
assertion `left == right` failed: T1→T2 with 2 waiters on T3
  left: 100
 right: 50

failures:
    cascade::engine::tests::cascade_extended_3node
    cascade::engine::tests::cascade_figure4
    cascade::engine::tests::concurrent_waiters_divides_weight
    cascade::engine::tests::depth_limit_changes_result
    cascade::engine::tests::total_attributed_less_than_raw
    cascade::invariants::tests::idempotency_actually_runs_cascade
    graph::sweep::tests::non_overlapping_edges
    graph::sweep::tests::single_edge_full_overlap
    graph::sweep::tests::single_edge_partial_overlap
    graph::sweep::tests::total_coverage_equals_sum_of_intervals
    graph::sweep::tests::two_overlapping_edges
    graph::wfg::tests::outgoing_edges

test result: FAILED. 49 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
