*** src/graph/wfg.rs:60:9: replace WaitForGraph::outgoing_edges -> Vec<(EdgeIndex, ThreadId, &EdgeWeight)> with vec![]

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::outgoing_edges -> Vec<(EdgeIndex, ThreadId, &EdgeWeight)> with vec![]
@@ -52,20 +52,17 @@
 
     /// Get NodeIndex for a ThreadId.
     pub fn node_index(&self, tid: &ThreadId) -> Option<NodeIndex> {
         self.node_map.get(tid).copied()
     }
 
     /// Get all outgoing edges from `node` as (EdgeIndex, dst_ThreadId, &EdgeWeight).
     pub fn outgoing_edges(&self, node: NodeIndex) -> Vec<(EdgeIndex, ThreadId, &EdgeWeight)> {
-        self.graph
-            .edges_directed(node, Direction::Outgoing)
-            .map(|e| (e.id(), self.graph[e.target()].tid, e.weight()))
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get all incoming edges to `node`.
     pub fn incoming_edges(&self, node: NodeIndex) -> Vec<(EdgeIndex, ThreadId, &EdgeWeight)> {
         self.graph
             .edges_directed(node, Direction::Incoming)
             .map(|e| (e.id(), self.graph[e.source()].tid, e.weight()))
             .collect()

---- graph::wfg::tests::outgoing_edges stdout ----

thread 'graph::wfg::tests::outgoing_edges' (353553) panicked at src/graph/wfg.rs:177:9:
assertion `left == right` failed
  left: 0
 right: 1

---- scc::heuristic::tests::apply_heuristic_sets_weights stdout ----

thread 'scc::heuristic::tests::apply_heuristic_sets_weights' (353555) panicked at src/scc/heuristic.rs:116:13:
super-node [ThreadId(1)] has zero weight

---- scc::heuristic::tests::heuristic_on_figure4 stdout ----

thread 'scc::heuristic::tests::heuristic_on_figure4' (353557) panicked at src/scc/heuristic.rs:139:9:
assertion `left == right` failed
  left: 20
 right: 80

failures:
    graph::wfg::tests::outgoing_edges
    scc::heuristic::tests::apply_heuristic_sets_weights
    scc::heuristic::tests::heuristic_on_figure4

test result: FAILED. 65 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
