*** src/graph/wfg.rs:92:9: replace WaitForGraph::node_count -> usize with 0

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::node_count -> usize with 0
@@ -84,17 +84,17 @@
             .collect();
         // Sort by (src_tid, dst_tid) for determinism
         result.sort_by_key(|(_, s, d, _)| (*s, *d));
         result
     }
 
     /// Total number of nodes.
     pub fn node_count(&self) -> usize {
-        self.graph.node_count()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total number of edges.
     pub fn edge_count(&self) -> usize {
         self.graph.edge_count()
     }
 
     /// Get edge weight by index.

---- cascade::invariants::tests::termination_detects_node_only_change stdout ----

thread 'cascade::invariants::tests::termination_detects_node_only_change' (356534) panicked at src/cascade/invariants.rs:321:9:
assertion failed: !check_termination(&g, &bad)

---- graph::wfg::tests::add_nodes_and_edges stdout ----

thread 'graph::wfg::tests::add_nodes_and_edges' (356553) panicked at src/graph/wfg.rs:171:9:
assertion `left == right` failed
  left: 0
 right: 2

---- graph::wfg::tests::idempotent_add_node stdout ----

thread 'graph::wfg::tests::idempotent_add_node' (356554) panicked at src/graph/wfg.rs:197:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    cascade::invariants::tests::termination_detects_node_only_change
    graph::wfg::tests::add_nodes_and_edges
    graph::wfg::tests::idempotent_add_node

test result: FAILED. 65 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
