*** src/graph/wfg.rs:97:9: replace WaitForGraph::edge_count -> usize with 1

*** mutation diff:
--- src/graph/wfg.rs
+++ replace WaitForGraph::edge_count -> usize with 1
@@ -89,17 +89,17 @@
 
     /// Total number of nodes.
     pub fn node_count(&self) -> usize {
         self.graph.node_count()
     }
 
     /// Total number of edges.
     pub fn edge_count(&self) -> usize {
-        self.graph.edge_count()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get edge weight by index.
     pub fn edge_weight(&self, idx: EdgeIndex) -> &EdgeWeight {
         &self.graph[idx]
     }
 
     /// Get mutable edge weight by index.

---- figure4_json_output stdout ----

thread 'figure4_json_output' (360171) panicked at tests/figure4.rs:84:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    figure4_json_output

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
